sergio1020881/PESTA2021/SandBox/ATMEGA128/Atmega128/Libraria/atmega128timer.c
	TIMER_COUNTER3A_COMPARE_REGISTER=0XFFFF;
	TIMER_COUNTER3A_CONTROL_REGISTER&=~((1<<WGM31) | (1<<WGM30));
	TIMER_COUNTER3B_CONTROL_REGISTER&=~((1<<WGM33) | (1<<WGM32));
	switch(wavegenmode){
		case 0: // Normal
			break;
		case 1: // PWM, Phase Correct, 8-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
			break;
		case 2:	// PWM, Phase Correct, 9-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
			break;
		case 3:	// PWM, Phase Correct, 10-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
			break;
		case 4:	// CTC
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
			break;
		case 5:	// Fast PWM, 8-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
			break;
		case 6:	// Fast PWM, 9-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
			break;
		case 7:	// Fast PWM, 10-bit
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM32);
			break;
		case 8:	// PWM, Phase and Frequency Correct
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
			break;
		case 9:	// PWM, Phase and Frequency Correct
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
			break;
		case 10: // PWM, Phase Correct
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
			break;
		case 11: // PWM, Phase Correct
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33);
			break;
		case 12: // CTC
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
			break;
		case 13: // (Reserved)
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
			break;
		case 14: // Fast PWM
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
			break;
		case 15: // Fast PWM
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<WGM31) | (1<<WGM30);
			TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<WGM33) | (1<<WGM32);
			break;
		default:
			break;
	}
	TIMER_COUNTER3A_CONTROL_REGISTER&=~((3<<COM3A0) | (3<<COM3B0)| (3<<COM3C0));
	EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER&=~((1<<TICIE3) | (1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3) | (1<<OCIE3C));
	switch(interrupt){
		case 0:
			break;
		case 1:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER=(1<<TOIE3);
			break;
		case 2:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A);
			break;
		case 3:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3B);
			break;
		case 4:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3C);
			break;
		case 5:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE3);
			break;
		case 6:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<TOIE3);
			break;
		case 7:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3B) | (1<<TOIE3);
			break;
		case 8:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TOIE3) | (1<<OCIE3C);
			break;
		case 9:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<TICIE3) | (1<<TOIE3);
			break;
		case 10:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3);
			break;
		case 11:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<TOIE3) | (1<<OCIE3C);
			break;
		case 12:
			EXTENDED_TIMER_COUNTER_INTERRUPT_MASK_REGISTER|=(1<<OCIE3A) | (1<<OCIE3B) | (1<<OCIE3C);
			break;
		default:
			break;
	}
	//
	timer3.compoutmodeA=TIMER_COUNTER3_compoutmodeA;
	timer3.compoutmodeB=TIMER_COUNTER3_compoutmodeB;
	timer3.compoutmodeC=TIMER_COUNTER3_compoutmodeC;
	timer3.compareA=TIMER_COUNTER3_compareA;
	timer3.compareB=TIMER_COUNTER3_compareB;
	timer3.compareC=TIMER_COUNTER3_compareC;
	timer3.start=TIMER_COUNTER3_start;
	timer3.stop=TIMER_COUNTER3_stop;
	return timer3;
}
void TIMER_COUNTER3_start(unsigned int prescaler)
/***
PARAMETER SETTING
Frequency oscillator devision factor or prescaler.
prescaler: clk T0S /(No prescaling); clk T0S /8 (From prescaler); clk T0S /64 (From prescaler);
clk T0S /256 (From prescaler); clk T0S /1024 (From prescaler); External clock source on Tn pin. Clock on falling edge;
External clock source on Tn pin. Clock on rising edge; default - clk T 0 S /1024 (From prescaler).
***/
{
	if(timer3_state==0){ // oneshot
		TIMER_COUNTER3B_CONTROL_REGISTER&=~(7<<CS30); // No clock source. (Timer/Counter stopped)
		switch(prescaler){
			case 1: // clkI/O/1 (No prescaling
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS30);
				break;
			case 8: // clkI/O/8 (From prescaler)
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS31);
				break;
			case 64: // clkI/O/64 (From prescaler)
				TIMER_COUNTER3B_CONTROL_REGISTER|=(3<<CS30);
				break;
			case 256: // clkI/O/256 (From prescaler)
				TIMER_COUNTER3B_CONTROL_REGISTER|=(1<<CS32);
				break;
			case 1024: // clkI/O/1024 (From prescaler)
				TIMER_COUNTER3B_CONTROL_REGISTER|=(5<<CS30);
				break;
			case 3: // External clock source on Tn pin. Clock on falling edge
				TIMER_COUNTER3B_CONTROL_REGISTER|=(6<<CS30);
				break;
			case 5: // External clock source on Tn pin. Clock on rising edge
				TIMER_COUNTER3B_CONTROL_REGISTER|=(7<<CS30);
				break;
			default:
				TIMER_COUNTER3B_CONTROL_REGISTER|=(5<<CS30);
				break;
		}
		STATUS_REGISTER|=1<<GLOBAL_INTERRUPT_ENABLE;
		timer3_state=1;
	}	
}
void TIMER_COUNTER3_compoutmodeA(unsigned char compoutmode)
{
	TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3A0);
	switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
		case 0: // Normal port operation, OC0 disconnected.
			break;
		case 1: // Reserved
				// Toggle OC3A on compare match
			DDRE|=0x08;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A0);
			break;
		case 2: // Clear OC3A on compare match when up-counting. Set OC0 on compare
				// match when downcounting.
				// Clear OC3A on compare match
			DDRE|=0x08;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A1);
			break;
		case 3: // Set OC3A on compare match when up-counting. Clear OC0 on compare
				// match when downcounting.
				// Set OC3A on compare match
			DDRE|=0x08;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3A0) | (1<<COM3A1);
			break;
		default:
			break;
	}
}
void TIMER_COUNTER3_compoutmodeB(unsigned char compoutmode)
{
	TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3B0);
	switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
		case 0: // Normal port operation, OC0 disconnected.
			break;
		case 1: // Reserved
				// Toggle OC3B on compare match
			DDRE|=0x10;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B0);
			break;
		case 2: // Clear OC3B on compare match when up-counting. Set OC0 on compare
				// match when downcounting.
				// Clear OC3B on compare match
			DDRE|=0x10;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B1);
			break;
		case 3: // Set OC3B on compare match when up-counting. Clear OC0 on compare
				// match when downcounting.
				// Set OC3B on compare match
			DDRE|=0x10;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3B0) | (1<<COM3B1);
			break;
		default:
			break;
	}
}
void TIMER_COUNTER3_compoutmodeC(unsigned char compoutmode)
{
	TIMER_COUNTER3A_CONTROL_REGISTER&=~(3<<COM3C0);
	switch(compoutmode){ // see table 53, 54, 55 in datasheet for more information
		case 0: // Normal port operation, OC0 disconnected.
			break;
		case 1: // Reserved
				// Toggle OC3C on compare match
			DDRE|=0x20;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C0);
			break;
		case 2: // Clear OC3C on compare match when up-counting. Set OC0 on compare
				// match when downcounting.
				// Clear OC3C on compare match
			DDRE|=0x20;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C1);
			break;
		case 3: // Set OC3C on compare match when up-counting. Clear OC0 on compare
				// match when downcounting.
				// Set OC3C on compare match
			DDRE|=0x20;
			TIMER_COUNTER3A_CONTROL_REGISTER|=(1<<COM3C0) | (1<<COM3C1);
			break;
		default:
			break;
	}
}
void TIMER_COUNTER3_compareA(uint16_t compare)
{
	TIMER_COUNTER3A_COMPARE_REGISTER=compare;
}
void TIMER_COUNTER3_compareB(uint16_t compare)
{
	TIMER_COUNTER3B_COMPARE_REGISTER=compare;
}
void TIMER_COUNTER3_compareC(uint16_t compare)
{
	TIMER_COUNTER3C_COMPARE_REGISTER=compare;
}
void TIMER_COUNTER3_stop(void)
/***
stops timer by setting prescaler to zero
***/
{
	TIMER_COUNTER3B_CONTROL_REGISTER&=~(7<<CS30); // No clock source. (Timer/Counter stopped)
	TIMER_COUNTER3_REGISTER=0X0000;
	timer3_state=0;
}
/***Interrupt***/
// So that main will not freeze when not defined, therefore exclude here! before use.
//ISR(TIMER0_COMP_vect){ }
ISR(TIMER0_OVF_vect){ }
ISR(TIMER1_CAPT_vect){ }
//ISR(TIMER1_COMPA_vect){ }
ISR(TIMER1_COMPB_vect){ }
ISR(TIMER1_COMPC_vect){ }
ISR(TIMER1_OVF_vect){ }
ISR(TIMER2_OVF_vect){ }
ISR(TIMER3_CAPT_vect){ }
ISR(TIMER3_COMPA_vect){ }
ISR(TIMER3_COMPB_vect){ }
ISR(TIMER3_COMPC_vect){ }
ISR(TIMER3_OVF_vect){ }
/***EOF***/
